{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.15.0",
  "convertedBy": "Sample Model Generator",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "LSTM",
          "config": {
            "name": "lstm",
            "trainable": true,
            "batch_input_shape": [null, 32, 126],
            "dtype": "float32",
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "units": 64,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {}},
            "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.0,
            "recurrent_dropout": 0.0
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.13.1",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {"name": "lstm/kernel", "shape": [126, 256], "dtype": "float32"},
        {"name": "lstm/recurrent_kernel", "shape": [64, 256], "dtype": "float32"},
        {"name": "lstm/bias", "shape": [256], "dtype": "float32"},
        {"name": "dense/kernel", "shape": [64, 32], "dtype": "float32"},
        {"name": "dense/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [32, 10], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}
      ]
    }
  ]
}


